Tekla.Structures.ModelInternal.dotSetTemporaryColors_t
Struct for setting temporary colors.

Tekla.Structures.ModelInternal.dotSetTemporaryColors_t.Color
Color to set

Tekla.Structures.ModelInternal.dotSetTemporaryColors_t.nObjects
Number of objects

Tekla.Structures.ModelInternal.dotSetTemporaryColors_t.AllObjects
All objects

Tekla.Structures.ModelInternal.dotSetTemporaryColors_t.aObjectIDs
IDs

Tekla.Structures.ModelInternal.dotSetTemporaryColors_t.aObjectSubIDs
Sub IDs